Revit 2027 API
ParameterTypeId.AutoPanel Property
 "Curtain Panel"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AutoPanel { get; }
Public Shared ReadOnly Property AutoPanel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AutoPanel {
	ForgeTypeId^ get ();
}
static member AutoPanel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace